CommunityGD32Cores/GD32Firmware/GD32L23x/GD32L23x_standard_peripheral/Include/gd32l23x_rcu.h
typedef enum {
    IDX_USART0 = 0U,                                              /*!< idnex of USART0 */
    IDX_USART1                                                    /*!< idnex of USART1 */
} usart_idx_enum;

typedef enum {
    IDX_I2C0 = 0U,                                                /*!< idnex of I2C0 */
    IDX_I2C1,                                                     /*!< idnex of I2C1 */
    IDX_I2C2                                                      /*!< idnex of I2C2 */
} i2c_idx_enum;

/* system clock source select */
#define CFG0_SCS(regval)            (BITS(0,1) & ((uint32_t)(regval) << 0U))
#define RCU_CKSYSSRC_IRC16M          CFG0_SCS(0)                   /*!< system clock source select IRC16M */
#define RCU_CKSYSSRC_HXTAL           CFG0_SCS(1)                   /*!< system clock source select HXTAL */
#define RCU_CKSYSSRC_PLL             CFG0_SCS(2)                   /*!< system clock source select PLL */
#define RCU_CKSYSSRC_IRC48M          CFG0_SCS(3)                   /*!< system clock source select IRC48M */

/* system clock source select status */
#define CFG0_SCSS(regval)           (BITS(2,3) & ((uint32_t)(regval) << 2U))
#define RCU_SCSS_IRC16M              CFG0_SCSS(0)                  /*!< system clock source select IRC16M */
#define RCU_SCSS_HXTAL               CFG0_SCSS(1)                  /*!< system clock source select HXTAL */
#define RCU_SCSS_PLL                 CFG0_SCSS(2)                  /*!< system clock source select PLL */
#define RCU_SCSS_IRC48M              CFG0_SCSS(3)                  /*!< system clock source select IRC48M */

/* AHB prescaler selection */
#define CFG0_AHBPSC(regval)         (BITS(4,7) & ((uint32_t)(regval) << 4U))
#define RCU_AHB_CKSYS_DIV1          CFG0_AHBPSC(0)                /*!< AHB prescaler select CK_SYS */
#define RCU_AHB_CKSYS_DIV2          CFG0_AHBPSC(8)                /*!< AHB prescaler select CK_SYS/2 */
#define RCU_AHB_CKSYS_DIV4          CFG0_AHBPSC(9)                /*!< AHB prescaler select CK_SYS/4 */
#define RCU_AHB_CKSYS_DIV8          CFG0_AHBPSC(10)               /*!< AHB prescaler select CK_SYS/8 */
#define RCU_AHB_CKSYS_DIV16         CFG0_AHBPSC(11)               /*!< AHB prescaler select CK_SYS/16 */
#define RCU_AHB_CKSYS_DIV64         CFG0_AHBPSC(12)               /*!< AHB prescaler select CK_SYS/64 */
#define RCU_AHB_CKSYS_DIV128        CFG0_AHBPSC(13)               /*!< AHB prescaler select CK_SYS/128 */
#define RCU_AHB_CKSYS_DIV256        CFG0_AHBPSC(14)               /*!< AHB prescaler select CK_SYS/256 */
#define RCU_AHB_CKSYS_DIV512        CFG0_AHBPSC(15)               /*!< AHB prescaler select CK_SYS/512 */

/* APB1 prescaler selection */
#define CFG0_APB1PSC(regval)        (BITS(8,10) & ((uint32_t)(regval) << 8U))
#define RCU_APB1_CKAHB_DIV1         CFG0_APB1PSC(0)               /*!< APB1 prescaler select CK_AHB */
#define RCU_APB1_CKAHB_DIV2         CFG0_APB1PSC(4)               /*!< APB1 prescaler select CK_AHB/2 */
#define RCU_APB1_CKAHB_DIV4         CFG0_APB1PSC(5)               /*!< APB1 prescaler select CK_AHB/4 */
#define RCU_APB1_CKAHB_DIV8         CFG0_APB1PSC(6)               /*!< APB1 prescaler select CK_AHB/8 */
#define RCU_APB1_CKAHB_DIV16        CFG0_APB1PSC(7)               /*!< APB1 prescaler select CK_AHB/16 */

/* APB2 prescaler selection */
#define CFG0_APB2PSC(regval)        (BITS(11,13) & ((uint32_t)(regval) << 11U))
#define RCU_APB2_CKAHB_DIV1         CFG0_APB2PSC(0)               /*!< APB2 prescaler select CK_AHB */
#define RCU_APB2_CKAHB_DIV2         CFG0_APB2PSC(4)               /*!< APB2 prescaler select CK_AHB/2 */
#define RCU_APB2_CKAHB_DIV4         CFG0_APB2PSC(5)               /*!< APB2 prescaler select CK_AHB/4 */
#define RCU_APB2_CKAHB_DIV8         CFG0_APB2PSC(6)               /*!< APB2 prescaler select CK_AHB/8 */
#define RCU_APB2_CKAHB_DIV16        CFG0_APB2PSC(7)               /*!< APB2 prescaler select CK_AHB/16 */

/* ADC clock prescaler selection */
#define CFG0_ADCPSC(regval)         (BITS(14,15) & ((uint32_t)(regval) << 14U))
#define CFG2_ADCPSC(regval)         (BITS(30,31) & ((uint32_t)(regval) << 30U))
#define CFG_ADCPSC(regval)          (BITS(0,4)& ((uint32_t)(regval)))
#define RCU_ADCCK_IRC16M            CFG_ADCPSC(16)                /*!< ADC clock select IRC16M */
#define RCU_ADCCK_APB2_DIV2         CFG_ADCPSC(0)                 /*!< ADC clock prescaler select CK_APB2/2 */
#define RCU_ADCCK_APB2_DIV4         CFG_ADCPSC(1)                 /*!< ADC clock prescaler select CK_APB2/4 */
#define RCU_ADCCK_APB2_DIV6         CFG_ADCPSC(2)                 /*!< ADC clock prescaler select CK_APB2/6 */
#define RCU_ADCCK_APB2_DIV8         CFG_ADCPSC(3)                 /*!< ADC clock prescaler select CK_APB2/8 */
#define RCU_ADCCK_APB2_DIV10        CFG_ADCPSC(4)                 /*!< ADC clock prescaler select CK_APB2/10 */
#define RCU_ADCCK_APB2_DIV12        CFG_ADCPSC(5)                 /*!< ADC clock prescaler select CK_APB2/12 */
#define RCU_ADCCK_APB2_DIV14        CFG_ADCPSC(6)                 /*!< ADC clock prescaler select CK_APB2/14 */
#define RCU_ADCCK_APB2_DIV16        CFG_ADCPSC(7)                 /*!< ADC clock prescaler select CK_APB2/16 */
#define RCU_ADCCK_AHB_DIV3          CFG_ADCPSC(8)                 /*!< ADC clock prescaler select CK_AHB/3 */
#define RCU_ADCCK_AHB_DIV5          CFG_ADCPSC(9)                 /*!< ADC clock prescaler select CK_AHB/5 */
#define RCU_ADCCK_AHB_DIV7          CFG_ADCPSC(10)                /*!< ADC clock prescaler select CK_AHB/7 */
#define RCU_ADCCK_AHB_DIV9          CFG_ADCPSC(11)                /*!< ADC clock prescaler select CK_AHB/9 */
#define RCU_ADCCK_AHB_DIV11         CFG_ADCPSC(12)                /*!< ADC clock prescaler select CK_AHB/11 */
#define RCU_ADCCK_AHB_DIV13         CFG_ADCPSC(13)                /*!< ADC clock prescaler select CK_AHB/13 */
#define RCU_ADCCK_AHB_DIV15         CFG_ADCPSC(14)                /*!< ADC clock prescaler select CK_AHB/15 */
#define RCU_ADCCK_AHB_DIV17         CFG_ADCPSC(15)                /*!< ADC clock prescaler select CK_AHB/17 */

/* PLL clock source selection */
#define CFG0_PLLSRC(regval)         (BITS(16,17) & ((uint32_t)(regval) << 16U))
#define RCU_PLLSRC_IRC16M           CFG0_PLLSRC(0)               /*!< PLL clock source select IRC16M */
#define RCU_PLLSRC_HXTAL            CFG0_PLLSRC(1)               /*!< PLL clock source select HXTAL */
#define RCU_PLLSRC_IRC48M           CFG0_PLLSRC(2)               /*!< PLL clock source select IRC48M */

