CommunityGD32Cores/GD32Firmware/GD32L23x/GD32L23x_standard_peripheral/Include/gd32l23x_rcu.h
/* PLL multiply factor */
#define PLLMF_6                     RCU_CFG0_PLLMF_6                    /*!< bit 6 of PLLMF */
#define CFG0_PLLMF(regval)          (BITS(18,23) & ((uint32_t)(regval) << 18U))
#define RCU_PLL_MUL4                CFG0_PLLMF(2)                 /*!< PLL source clock multiply by 4 */
#define RCU_PLL_MUL5                CFG0_PLLMF(3)                 /*!< PLL source clock multiply by 5 */
#define RCU_PLL_MUL6                CFG0_PLLMF(4)                 /*!< PLL source clock multiply by 6 */
#define RCU_PLL_MUL7                CFG0_PLLMF(5)                 /*!< PLL source clock multiply by 7 */
#define RCU_PLL_MUL8                CFG0_PLLMF(6)                 /*!< PLL source clock multiply by 8 */
#define RCU_PLL_MUL9                CFG0_PLLMF(7)                 /*!< PLL source clock multiply by 9 */
#define RCU_PLL_MUL10               CFG0_PLLMF(8)                 /*!< PLL source clock multiply by 10 */
#define RCU_PLL_MUL11               CFG0_PLLMF(9)                 /*!< PLL source clock multiply by 11 */
#define RCU_PLL_MUL12               CFG0_PLLMF(10)                /*!< PLL source clock multiply by 12 */
#define RCU_PLL_MUL13               CFG0_PLLMF(11)                /*!< PLL source clock multiply by 13 */
#define RCU_PLL_MUL14               CFG0_PLLMF(12)                /*!< PLL source clock multiply by 14 */
#define RCU_PLL_MUL15               CFG0_PLLMF(13)                /*!< PLL source clock multiply by 15 */
#define RCU_PLL_MUL16               CFG0_PLLMF(14)                /*!< PLL source clock multiply by 16 */
#define RCU_PLL_MUL17               CFG0_PLLMF(16)                /*!< PLL source clock multiply by 17 */
#define RCU_PLL_MUL18               CFG0_PLLMF(17)                /*!< PLL source clock multiply by 18 */
#define RCU_PLL_MUL19               CFG0_PLLMF(18)                /*!< PLL source clock multiply by 19 */
#define RCU_PLL_MUL20               CFG0_PLLMF(19)                /*!< PLL source clock multiply by 20 */
#define RCU_PLL_MUL21               CFG0_PLLMF(20)                /*!< PLL source clock multiply by 21 */
#define RCU_PLL_MUL22               CFG0_PLLMF(21)                /*!< PLL source clock multiply by 22 */
#define RCU_PLL_MUL23               CFG0_PLLMF(22)                /*!< PLL source clock multiply by 23 */
#define RCU_PLL_MUL24               CFG0_PLLMF(23)                /*!< PLL source clock multiply by 24 */
#define RCU_PLL_MUL25               CFG0_PLLMF(24)                /*!< PLL source clock multiply by 25 */
#define RCU_PLL_MUL26               CFG0_PLLMF(25)                /*!< PLL source clock multiply by 26 */
#define RCU_PLL_MUL27               CFG0_PLLMF(26)                /*!< PLL source clock multiply by 27 */
#define RCU_PLL_MUL28               CFG0_PLLMF(27)                /*!< PLL source clock multiply by 28 */
#define RCU_PLL_MUL29               CFG0_PLLMF(28)                /*!< PLL source clock multiply by 29 */
#define RCU_PLL_MUL30               CFG0_PLLMF(29)                /*!< PLL source clock multiply by 30 */
#define RCU_PLL_MUL31               CFG0_PLLMF(30)                /*!< PLL source clock multiply by 31 */
#define RCU_PLL_MUL32               CFG0_PLLMF(31)                /*!< PLL source clock multiply by 32 */
#define RCU_PLL_MUL33               CFG0_PLLMF(32)                /*!< PLL source clock multiply by 33 */
#define RCU_PLL_MUL34               CFG0_PLLMF(33)                /*!< PLL source clock multiply by 34 */
#define RCU_PLL_MUL35               CFG0_PLLMF(34)                /*!< PLL source clock multiply by 35 */
#define RCU_PLL_MUL36               CFG0_PLLMF(35)                /*!< PLL source clock multiply by 36 */
#define RCU_PLL_MUL37               CFG0_PLLMF(36)                /*!< PLL source clock multiply by 37 */
#define RCU_PLL_MUL38               CFG0_PLLMF(37)                /*!< PLL source clock multiply by 38 */
#define RCU_PLL_MUL39               CFG0_PLLMF(38)                /*!< PLL source clock multiply by 39 */
#define RCU_PLL_MUL40               CFG0_PLLMF(39)                /*!< PLL source clock multiply by 40 */
#define RCU_PLL_MUL41               CFG0_PLLMF(40)                /*!< PLL source clock multiply by 41 */
#define RCU_PLL_MUL42               CFG0_PLLMF(41)                /*!< PLL source clock multiply by 42 */
#define RCU_PLL_MUL43               CFG0_PLLMF(42)                /*!< PLL source clock multiply by 43 */
#define RCU_PLL_MUL44               CFG0_PLLMF(43)                /*!< PLL source clock multiply by 44 */
#define RCU_PLL_MUL45               CFG0_PLLMF(44)                /*!< PLL source clock multiply by 45 */
#define RCU_PLL_MUL46               CFG0_PLLMF(45)                /*!< PLL source clock multiply by 46 */
#define RCU_PLL_MUL47               CFG0_PLLMF(46)                /*!< PLL source clock multiply by 47 */
#define RCU_PLL_MUL48               CFG0_PLLMF(47)                /*!< PLL source clock multiply by 48 */
#define RCU_PLL_MUL49               CFG0_PLLMF(48)                /*!< PLL source clock multiply by 49 */
#define RCU_PLL_MUL50               CFG0_PLLMF(49)                /*!< PLL source clock multiply by 50 */
#define RCU_PLL_MUL51               CFG0_PLLMF(50)                /*!< PLL source clock multiply by 51 */
#define RCU_PLL_MUL52               CFG0_PLLMF(51)                /*!< PLL source clock multiply by 52 */
#define RCU_PLL_MUL53               CFG0_PLLMF(52)                /*!< PLL source clock multiply by 53 */
#define RCU_PLL_MUL54               CFG0_PLLMF(53)                /*!< PLL source clock multiply by 54 */
#define RCU_PLL_MUL55               CFG0_PLLMF(54)                /*!< PLL source clock multiply by 55 */
#define RCU_PLL_MUL56               CFG0_PLLMF(55)                /*!< PLL source clock multiply by 56 */
#define RCU_PLL_MUL57               CFG0_PLLMF(56)                /*!< PLL source clock multiply by 57 */
#define RCU_PLL_MUL58               CFG0_PLLMF(57)                /*!< PLL source clock multiply by 58 */
#define RCU_PLL_MUL59               CFG0_PLLMF(58)                /*!< PLL source clock multiply by 59 */
#define RCU_PLL_MUL60               CFG0_PLLMF(59)                /*!< PLL source clock multiply by 60 */
#define RCU_PLL_MUL61               CFG0_PLLMF(60)                /*!< PLL source clock multiply by 61 */
#define RCU_PLL_MUL62               CFG0_PLLMF(61)                /*!< PLL source clock multiply by 62 */
#define RCU_PLL_MUL63               CFG0_PLLMF(62)                /*!< PLL source clock multiply by 63 */
#define RCU_PLL_MUL64               CFG0_PLLMF(63)                /*!< PLL source clock multiply by 64 */
#define RCU_PLL_MUL63               CFG0_PLLMF(62)                /*!< PLL source clock multiply by 63 */
#define RCU_PLL_MUL64               CFG0_PLLMF(63)                /*!< PLL source clock multiply by 64 */
#define RCU_PLL_MUL65              (PLLMF_6 | CFG0_PLLMF(0))      /*!< PLL source clock multiply by 65 */
#define RCU_PLL_MUL66              (PLLMF_6 | CFG0_PLLMF(1))      /*!< PLL source clock multiply by 66 */
#define RCU_PLL_MUL67              (PLLMF_6 | CFG0_PLLMF(2))      /*!< PLL source clock multiply by 67 */
#define RCU_PLL_MUL68              (PLLMF_6 | CFG0_PLLMF(3))      /*!< PLL source clock multiply by 68 */
#define RCU_PLL_MUL69              (PLLMF_6 | CFG0_PLLMF(4))      /*!< PLL source clock multiply by 69 */
#define RCU_PLL_MUL70              (PLLMF_6 | CFG0_PLLMF(5))      /*!< PLL source clock multiply by 70 */
#define RCU_PLL_MUL71              (PLLMF_6 | CFG0_PLLMF(6))      /*!< PLL source clock multiply by 71 */
#define RCU_PLL_MUL72              (PLLMF_6 | CFG0_PLLMF(7))      /*!< PLL source clock multiply by 72 */
#define RCU_PLL_MUL73              (PLLMF_6 | CFG0_PLLMF(8))      /*!< PLL source clock multiply by 73 */
#define RCU_PLL_MUL74              (PLLMF_6 | CFG0_PLLMF(9))      /*!< PLL source clock multiply by 74 */
#define RCU_PLL_MUL75              (PLLMF_6 | CFG0_PLLMF(10))     /*!< PLL source clock multiply by 75 */
#define RCU_PLL_MUL76              (PLLMF_6 | CFG0_PLLMF(11))     /*!< PLL source clock multiply by 76 */
#define RCU_PLL_MUL77              (PLLMF_6 | CFG0_PLLMF(12))     /*!< PLL source clock multiply by 77 */
#define RCU_PLL_MUL78              (PLLMF_6 | CFG0_PLLMF(13))     /*!< PLL source clock multiply by 78 */
#define RCU_PLL_MUL79              (PLLMF_6 | CFG0_PLLMF(14))     /*!< PLL source clock multiply by 79 */
#define RCU_PLL_MUL80              (PLLMF_6 | CFG0_PLLMF(15))     /*!< PLL source clock multiply by 80 */
#define RCU_PLL_MUL81              (PLLMF_6 | CFG0_PLLMF(16))     /*!< PLL source clock multiply by 81 */
#define RCU_PLL_MUL82              (PLLMF_6 | CFG0_PLLMF(17))     /*!< PLL source clock multiply by 82 */
#define RCU_PLL_MUL83              (PLLMF_6 | CFG0_PLLMF(18))     /*!< PLL source clock multiply by 83 */
#define RCU_PLL_MUL84              (PLLMF_6 | CFG0_PLLMF(19))     /*!< PLL source clock multiply by 84 */
#define RCU_PLL_MUL85              (PLLMF_6 | CFG0_PLLMF(20))     /*!< PLL source clock multiply by 85 */
#define RCU_PLL_MUL86              (PLLMF_6 | CFG0_PLLMF(21))     /*!< PLL source clock multiply by 86 */
#define RCU_PLL_MUL87              (PLLMF_6 | CFG0_PLLMF(22))     /*!< PLL source clock multiply by 87 */
#define RCU_PLL_MUL88              (PLLMF_6 | CFG0_PLLMF(23))     /*!< PLL source clock multiply by 88 */
#define RCU_PLL_MUL89              (PLLMF_6 | CFG0_PLLMF(24))     /*!< PLL source clock multiply by 89 */
#define RCU_PLL_MUL90              (PLLMF_6 | CFG0_PLLMF(25))     /*!< PLL source clock multiply by 90 */
#define RCU_PLL_MUL91              (PLLMF_6 | CFG0_PLLMF(26))     /*!< PLL source clock multiply by 91 */
#define RCU_PLL_MUL92              (PLLMF_6 | CFG0_PLLMF(27))     /*!< PLL source clock multiply by 92 */
#define RCU_PLL_MUL93              (PLLMF_6 | CFG0_PLLMF(28))     /*!< PLL source clock multiply by 93 */
#define RCU_PLL_MUL94              (PLLMF_6 | CFG0_PLLMF(29))     /*!< PLL source clock multiply by 94 */
#define RCU_PLL_MUL95              (PLLMF_6 | CFG0_PLLMF(30))     /*!< PLL source clock multiply by 95 */
#define RCU_PLL_MUL96              (PLLMF_6 | CFG0_PLLMF(31))     /*!< PLL source clock multiply by 96 */
#define RCU_PLL_MUL97              (PLLMF_6 | CFG0_PLLMF(32))     /*!< PLL source clock multiply by 97 */
#define RCU_PLL_MUL98              (PLLMF_6 | CFG0_PLLMF(33))     /*!< PLL source clock multiply by 98 */
#define RCU_PLL_MUL99              (PLLMF_6 | CFG0_PLLMF(34))     /*!< PLL source clock multiply by 99 */
#define RCU_PLL_MUL100             (PLLMF_6 | CFG0_PLLMF(35))     /*!< PLL source clock multiply by 100 */
#define RCU_PLL_MUL101             (PLLMF_6 | CFG0_PLLMF(36))     /*!< PLL source clock multiply by 101 */
#define RCU_PLL_MUL102             (PLLMF_6 | CFG0_PLLMF(37))     /*!< PLL source clock multiply by 102 */
#define RCU_PLL_MUL103             (PLLMF_6 | CFG0_PLLMF(38))     /*!< PLL source clock multiply by 103 */
#define RCU_PLL_MUL104             (PLLMF_6 | CFG0_PLLMF(39))     /*!< PLL source clock multiply by 104 */
#define RCU_PLL_MUL105             (PLLMF_6 | CFG0_PLLMF(40))     /*!< PLL source clock multiply by 105 */
#define RCU_PLL_MUL106             (PLLMF_6 | CFG0_PLLMF(41))     /*!< PLL source clock multiply by 106 */
#define RCU_PLL_MUL107             (PLLMF_6 | CFG0_PLLMF(42))     /*!< PLL source clock multiply by 107 */
#define RCU_PLL_MUL108             (PLLMF_6 | CFG0_PLLMF(43))     /*!< PLL source clock multiply by 108 */
#define RCU_PLL_MUL109             (PLLMF_6 | CFG0_PLLMF(44))     /*!< PLL source clock multiply by 109 */
#define RCU_PLL_MUL110             (PLLMF_6 | CFG0_PLLMF(45))     /*!< PLL source clock multiply by 110 */
#define RCU_PLL_MUL111             (PLLMF_6 | CFG0_PLLMF(46))     /*!< PLL source clock multiply by 111 */
#define RCU_PLL_MUL112             (PLLMF_6 | CFG0_PLLMF(47))     /*!< PLL source clock multiply by 112 */
#define RCU_PLL_MUL113             (PLLMF_6 | CFG0_PLLMF(48))     /*!< PLL source clock multiply by 113 */
#define RCU_PLL_MUL114             (PLLMF_6 | CFG0_PLLMF(49))     /*!< PLL source clock multiply by 114 */
#define RCU_PLL_MUL115             (PLLMF_6 | CFG0_PLLMF(50))     /*!< PLL source clock multiply by 115 */
#define RCU_PLL_MUL116             (PLLMF_6 | CFG0_PLLMF(51))     /*!< PLL source clock multiply by 116 */
#define RCU_PLL_MUL117             (PLLMF_6 | CFG0_PLLMF(52))     /*!< PLL source clock multiply by 117 */
#define RCU_PLL_MUL118             (PLLMF_6 | CFG0_PLLMF(53))     /*!< PLL source clock multiply by 118 */
#define RCU_PLL_MUL119             (PLLMF_6 | CFG0_PLLMF(54))     /*!< PLL source clock multiply by 119 */
#define RCU_PLL_MUL120             (PLLMF_6 | CFG0_PLLMF(55))     /*!< PLL source clock multiply by 120 */
#define RCU_PLL_MUL121             (PLLMF_6 | CFG0_PLLMF(56))     /*!< PLL source clock multiply by 121 */
#define RCU_PLL_MUL122             (PLLMF_6 | CFG0_PLLMF(57))     /*!< PLL source clock multiply by 122 */
#define RCU_PLL_MUL123             (PLLMF_6 | CFG0_PLLMF(58))     /*!< PLL source clock multiply by 123 */
#define RCU_PLL_MUL124             (PLLMF_6 | CFG0_PLLMF(59))     /*!< PLL source clock multiply by 124 */
#define RCU_PLL_MUL125             (PLLMF_6 | CFG0_PLLMF(60))     /*!< PLL source clock multiply by 125 */
#define RCU_PLL_MUL126             (PLLMF_6 | CFG0_PLLMF(61))     /*!< PLL source clock multiply by 126 */
#define RCU_PLL_MUL127             (PLLMF_6 | CFG0_PLLMF(62))     /*!< PLL source clock multiply by 127 */

/* CK_OUT clock source selection */
#define CFG0_CKOUTSEL(regval)       (BITS(24,26) & ((uint32_t)(regval) << 24U))
#define RCU_CKOUTSRC_NONE           CFG0_CKOUTSEL(0)                    /*!< no clock selected */
#define RCU_CKOUTSRC_IRC48M         CFG0_CKOUTSEL(1)                    /*!< CK_OUT clock source select IRC48M */
#define RCU_CKOUTSRC_IRC32K         CFG0_CKOUTSEL(2)                    /*!< CK_OUT clock source select IRC32K */
#define RCU_CKOUTSRC_LXTAL          CFG0_CKOUTSEL(3)                    /*!< CK_OUT clock source select LXTAL */
#define RCU_CKOUTSRC_CKSYS          CFG0_CKOUTSEL(4)                    /*!< CK_OUT clock source select CKSYS */
#define RCU_CKOUTSRC_IRC16M         CFG0_CKOUTSEL(5)                    /*!< CK_OUT clock source select IRC16M */
#define RCU_CKOUTSRC_HXTAL          CFG0_CKOUTSEL(6)                    /*!< CK_OUT clock source select HXTAL */
#define RCU_CKOUTSRC_CKPLL_DIV1     (RCU_CFG0_PLLDV | CFG0_CKOUTSEL(7)) /*!< CK_OUT clock source select CK_PLL */
#define RCU_CKOUTSRC_CKPLL_DIV2     CFG0_CKOUTSEL(7)                    /*!< CK_OUT clock source select CK_PLL/2 */

/* CK_OUT divider */
#define CFG0_CKOUTDIV(regval)       (BITS(28,30) & ((uint32_t)(regval) << 28U))
#define RCU_CKOUT_DIV1              CFG0_CKOUTDIV(0)                    /*!< CK_OUT is divided by 1 */
#define RCU_CKOUT_DIV2              CFG0_CKOUTDIV(1)                    /*!< CK_OUT is divided by 2 */
#define RCU_CKOUT_DIV4              CFG0_CKOUTDIV(2)                    /*!< CK_OUT is divided by 4 */
#define RCU_CKOUT_DIV8              CFG0_CKOUTDIV(3)                    /*!< CK_OUT is divided by 8 */
#define RCU_CKOUT_DIV16             CFG0_CKOUTDIV(4)                    /*!< CK_OUT is divided by 16 */
#define RCU_CKOUT_DIV32             CFG0_CKOUTDIV(5)                    /*!< CK_OUT is divided by 32 */
#define RCU_CKOUT_DIV64             CFG0_CKOUTDIV(6)                    /*!< CK_OUT is divided by 64 */
#define RCU_CKOUT_DIV128            CFG0_CKOUTDIV(7)                    /*!< CK_OUT is divided by 128 */

/* CK_PLL divide by 1 or 2 for CK_OUT */
#define RCU_PLLDV_CKPLL_DIV2        (uint32_t)0x00000000U               /*!< CK_PLL divide by 2 for CK_OUT */
#define RCU_PLLDV_CKPLL             RCU_CFG0_PLLDV                      /*!< CK_PLL divide by 1 for CK_OUT */

/* LXTAL drive capability */
#define BDCTL_LXTALDRI(regval)      (BITS(3,4) & ((uint32_t)(regval) << 3U))
#define RCU_LXTAL_LOWDRI            BDCTL_LXTALDRI(0)                   /*!< lower driving capability */
#define RCU_LXTAL_MED_LOWDRI        BDCTL_LXTALDRI(1)                   /*!< medium low driving capability */
#define RCU_LXTAL_MED_HIGHDRI       BDCTL_LXTALDRI(2)                   /*!< medium high driving capability */
#define RCU_LXTAL_HIGHDRI           BDCTL_LXTALDRI(3)                   /*!< higher driving capability */

/* RTC clock entry selection */
#define BDCTL_RTCSRC(regval)        (BITS(8,9) & ((uint32_t)(regval) << 8U))
#define RCU_RTCSRC_NONE             BDCTL_RTCSRC(0)                     /*!< no clock selected */
#define RCU_RTCSRC_LXTAL            BDCTL_RTCSRC(1)                     /*!< LXTAL selected as RTC source clock */
#define RCU_RTCSRC_IRC32K           BDCTL_RTCSRC(2)                     /*!< IRC32K selected as RTC source clock */
#define RCU_RTCSRC_HXTAL_DIV32      BDCTL_RTCSRC(3)                     /*!< HXTAL/32 selected as RTC source clock */

