CommunityGD32Cores/GD32Firmware/GD32L23x/GD32L23x_standard_peripheral/Include/gd32l23x_rcu.h
/* CK_HXTAL divider previous PLL */
#define CFG1_PREDV(regval)         (BITS(0,3) & ((uint32_t)(regval) << 0U))
#define RCU_PLL_PREDV1              CFG1_PREDV(0)                       /*!< PLL not divided */
#define RCU_PLL_PREDV2              CFG1_PREDV(1)                       /*!< PLL divided by 2 */
#define RCU_PLL_PREDV3              CFG1_PREDV(2)                       /*!< PLL divided by 3 */
#define RCU_PLL_PREDV4              CFG1_PREDV(3)                       /*!< PLL divided by 4 */
#define RCU_PLL_PREDV5              CFG1_PREDV(4)                       /*!< PLL divided by 5 */
#define RCU_PLL_PREDV6              CFG1_PREDV(5)                       /*!< PLL divided by 6 */
#define RCU_PLL_PREDV7              CFG1_PREDV(6)                       /*!< PLL divided by 7 */
#define RCU_PLL_PREDV8              CFG1_PREDV(7)                       /*!< PLL divided by 8 */
#define RCU_PLL_PREDV9              CFG1_PREDV(8)                       /*!< PLL divided by 9 */
#define RCU_PLL_PREDV10             CFG1_PREDV(9)                       /*!< PLL divided by 10 */
#define RCU_PLL_PREDV11             CFG1_PREDV(10)                      /*!< PLL divided by 11 */
#define RCU_PLL_PREDV12             CFG1_PREDV(11)                      /*!< PLL divided by 12 */
#define RCU_PLL_PREDV13             CFG1_PREDV(12)                      /*!< PLL divided by 13 */
#define RCU_PLL_PREDV14             CFG1_PREDV(13)                      /*!< PLL divided by 14 */
#define RCU_PLL_PREDV15             CFG1_PREDV(14)                      /*!< PLL divided by 15 */
#define RCU_PLL_PREDV16             CFG1_PREDV(15)                      /*!< PLL divided by 16 */

/* USART0 clock source selection */
#define CFG2_USART0SEL(regval)      (BITS(0,1) & ((uint32_t)(regval) << 0U))
#define RCU_USART0SRC_CKAPB2        CFG2_USART0SEL(0)                   /*!< CK_USART0 select CK_APB2 */
#define RCU_USART0SRC_CKSYS         CFG2_USART0SEL(1)                   /*!< CK_USART0 select CK_SYS */
#define RCU_USART0SRC_LXTAL         CFG2_USART0SEL(2)                   /*!< CK_USART0 select LXTAL */
#define RCU_USART0SRC_IRC16MDIV     CFG2_USART0SEL(3)                   /*!< CK_USART0 select IRC16MDIV */

/* LPUART clock source selection */
#define CFG2_LPUARTSEL(regval)      (BITS(11,12) & ((uint32_t)(regval) << 11U))
#define RCU_LPUARTSRC_CKAPB1        CFG2_LPUARTSEL(0)                   /*!< CK_LPUART select CK_APB1 */
#define RCU_LPUARTSRC_CKSYS         CFG2_LPUARTSEL(1)                   /*!< CK_LPUART select CK_SYS */
#define RCU_LPUARTSRC_LXTAL         CFG2_LPUARTSEL(2)                   /*!< CK_LPUART select LXTAL */
#define RCU_LPUARTSRC_IRC16MDIV     CFG2_LPUARTSEL(3)                   /*!< CK_LPUART select IRC16MDIV */

/* USART1 clock source selection */
#define CFG2_USART1SEL(regval)      (BITS(16,17) & ((uint32_t)(regval) << 16U))
#define RCU_USART1SRC_CKAPB1         CFG2_USART1SEL(0)                  /*!< CK_USART1 select CK_APB1 */
#define RCU_USART1SRC_CKSYS          CFG2_USART1SEL(1)                  /*!< CK_USART1 select CK_SYS */
#define RCU_USART1SRC_LXTAL          CFG2_USART1SEL(2)                  /*!< CK_USART1 select LXTAL */
#define RCU_USART1SRC_IRC16MDIV      CFG2_USART1SEL(3)                  /*!< CK_USART1 select IRC16MDIV */

/* USARTx(x=0,1) clock source selection */
#define CFG2_USART0SEL(regval)      (BITS(0,1) & ((uint32_t)(regval) << 0U))
#define RCU_USARTSRC_CKAPB           CFG2_USART0SEL(0)                  /*!< CK_USART select CK_APB1/CK_APB2 */
#define RCU_USARTSRC_CKSYS           CFG2_USART0SEL(1)                  /*!< CK_USART select CK_SYS */
#define RCU_USARTSRC_LXTAL           CFG2_USART0SEL(2)                  /*!< CK_USART select LXTAL */
#define RCU_USARTSRC_IRC16MDIV       CFG2_USART0SEL(3)                  /*!< CK_USART select IRC16MDIV */

/* I2Cx(x=0,1,2) clock source selection */
#define CFG2_I2C0SEL(regval)        (BITS(2,3) & ((uint32_t)(regval) << 2U))
#define RCU_I2CSRC_CKAPB1            CFG2_I2C0SEL(0)                    /*!< CK_I2C select CK_APB1 */
#define RCU_I2CSRC_CKSYS             CFG2_I2C0SEL(1)                    /*!< CK_I2C select CK_SYS */
#define RCU_I2CSRC_IRC16MDIV         CFG2_I2C0SEL(2)                    /*!< CK_I2C select IRC16MDIV */

/* LPTIMER clock source selection */
#define CFG2_LPTIMERSEL(regval)      (BITS(9,10) & ((uint32_t)(regval) << 9U))
#define RCU_LPTIMERSRC_CKAPB1        CFG2_LPTIMERSEL(0)                 /*!< CK_LPTIMER select CK_APB1 */
#define RCU_LPTIMERSRC_IRC32K        CFG2_LPTIMERSEL(1)                 /*!< CK_LPTIMER select CK_IRC32K */
#define RCU_LPTIMERSRC_LXTAL         CFG2_LPTIMERSEL(2)                 /*!< CK_LPTIMER select LXTAL */
#define RCU_LPTIMERSRC_IRC16MDIV     CFG2_LPTIMERSEL(3)                 /*!< CK_LPTIMER select IRC16MDIV */

/* IRC16MDIV clock source selection */
#define CFG2_IRC16MDIVSEL(regval)    (BITS(18,20) & ((uint32_t)(regval) << 18U))
#define RCU_IRC16MDIV_NONE           CFG2_IRC16MDIVSEL(0)               /*!< CK_IRC16MDIV select CK_IRC16M */
#define RCU_IRC16MDIV_2              CFG2_IRC16MDIVSEL(4)               /*!< CK_IRC16MDIV select CK_IRC16M divided by 2 */
#define RCU_IRC16MDIV_4              CFG2_IRC16MDIVSEL(5)               /*!< CK_IRC16MDIV select CK_IRC16M divided by 4 */
#define RCU_IRC16MDIV_8              CFG2_IRC16MDIVSEL(6)               /*!< CK_IRC16MDIV select CK_IRC16M divided by 8 */
#define RCU_IRC16MDIV_16             CFG2_IRC16MDIVSEL(7)               /*!< CK_IRC16MDIV select CK_IRC16M divided by 16 */

/* USBD clock source selection */
#define RCU_USBDSRC_IRC48M           (uint32_t)0x00000000U              /*!< CK_USBD select CK_IRC48M */
#define RCU_USBDSRC_PLL              RCU_CFG2_USBDSEL                   /*!< CK_USBD select CK_PLL */

/* ADC clock source selection */
#define RCU_ADCSRC_IRC16M            (uint32_t)0x00000000U              /*!< ADC clock source select */
#define RCU_ADCSRC_AHB_APB2DIV       RCU_CFG2_ADCSEL                    /*!< ADC clock source select */

/* low power mode LDO voltage selection */
#define RCU_LP_LDO_V_0_8             (uint32_t)0x00000000U              /*!< LP_LDO output voltage 0.8V */
#define RCU_LP_LDO_V_0_9             RCU_LPLDO_LPLDOVOS                 /*!< LP_LDO output voltage 0.9V */

